src/cf/InformationRegisters/ОтветственныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛица</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыСтруктурныхЕдиниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ТипыСтруктурныхЕдиниц</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Касса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ОтветственныеЛица/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьТипСтруктурнойЕдиницы()
	Если ТипСтруктурнойЕдиницы=ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Склад") Тогда
		Если НЕ ТипЗнч(Запись.СтруктурнаяЕдиница)=Тип("СправочникСсылка.Склады") Тогда
			Запись.СтруктурнаяЕдиница=ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка");
		КонецЕсли;
	Иначе
		Если НЕ ТипЗнч(Запись.СтруктурнаяЕдиница)=Тип("СправочникСсылка.Кассы") Тогда
			Запись.СтруктурнаяЕдиница=ПредопределенноеЗначение("Справочник.Кассы.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсторию(Команда)
	СтруктураОтбора=Новый Структура("СтруктурнаяЕдиница", Запись.СтруктурнаяЕдиница);
	ОткрытьФорму("РегистрСведений.ОтветственныеЛица.ФормаСписка", Новый Структура("Отбор", СтруктураОтбора));
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="СтруктурнаяЕдиница" Тогда
		Заголовок="Ответственное лицо для: "+СокрЛП(Запись.СтруктурнаяЕдиница);
	КонецЕсли;
	УстановитьТипСтруктурнойЕдиницы();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Заголовок="Ответственное лицо для: "+СокрЛП(Запись.СтруктурнаяЕдиница);

	Если НЕ ЗначениеЗаполнено(ТипСтруктурнойЕдиницы) Тогда
		Если ТипЗнч(Запись.СтруктурнаяЕдиница) = Тип("СправочникСсылка.Склады") Тогда
			ТипСтруктурнойЕдиницы  = ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Склад");
		Иначе
			ТипСтруктурнойЕдиницы  = ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Касса");
		КонецЕсли;
	КонецЕсли;

	Если НЕ ВладелецФормы=Неопределено Тогда
		ФормаВладельца=ОбщегоНазначенияКлиент.ОбъектФормыПоЭлементу(ВладелецФормы, "ФормаКлиентскогоПриложения");
		Если НЕ ФормаВладельца=Неопределено Тогда
			Если ФормаВладельца.ИмяФормы="Справочник.Склады.Форма.ФормаЭлемента" Тогда
			Элементы.ГруппаСтруктурнаяЕдиница.Доступность=Ложь;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	УстановитьТипСтруктурнойЕдиницы();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","ОтветственноеЛицо"), Запись.СтруктурнаяЕдиница);
КонецПроцедуры
